// Задача 10: Напишите программу, которая принимает на вход трёхзначное число
// и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1


// Console.Write("Введите трёхзначное число: ");
// string num = Console.ReadLine();
// Console.WriteLine("2-я цифра: " + num[1]);

// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает,
// что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

// Console.Write("Введите трёхзначное число: ");
// string num = Console.ReadLine();
// if(num.Length >= 3)
//     Console.WriteLine("Третья цифра: " + num[2]);
// else
//     Console.WriteLine("Третьей цифры нет");

// Задача 15: Напишите программу, которая принимает на вход цифру, 
//обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

// Console.Write("Bведите день недели: ");
// int day = Convert.ToInt32(Console.ReadLine());
// if(6 <= day && day <= 7)
//     Console.Write("выходной");
// else
//     Console.Write("не выходной");
